const String ARABIC_LETTERS_LIST = 'ءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىي';

const List<String> DIACRITICS_LIST = ['َ', 'ً', 'ِ', 'ٍ', 'ُ', 'ٌ', 'ْ', 'ّ'];

const Map<String, int> RNN_BIG_CHARACTERS_MAPPING = {
  '<PAD>': 0,
  '<SOS>': 1,
  '<EOS>': 2,
  '<UNK>': 3,
  '\n': 4,
  ' ': 5,
  '!': 6,
  '"': 7,
  '&': 8,
  "'": 9,
  '(': 10,
  ')': 11,
  '*': 12,
  '+': 13,
  ',': 14,
  '-': 15,
  '.': 16,
  '/': 17,
  '0': 18,
  '1': 19,
  '2': 20,
  '3': 21,
  '4': 22,
  '5': 23,
  '6': 24,
  '7': 25,
  '8': 26,
  '9': 27,
  ':': 28,
  ';': 29,
  '=': 30,
  '[': 31,
  ']': 32,
  '_': 33,
  '`': 34,
  '{': 35,
  '}': 36,
  '~': 37,
  '«': 38,
  '»': 39,
  '،': 40,
  '؛': 41,
  '؟': 42,
  'ء': 43,
  'آ': 44,
  'أ': 45,
  'ؤ': 46,
  'إ': 47,
  'ئ': 48,
  'ا': 49,
  'ب': 50,
  'ة': 51,
  'ت': 52,
  'ث': 53,
  'ج': 54,
  'ح': 55,
  'خ': 56,
  'د': 57,
  'ذ': 58,
  'ر': 59,
  'ز': 60,
  'س': 61,
  'ش': 62,
  'ص': 63,
  'ض': 64,
  'ط': 65,
  'ظ': 66,
  'ع': 67,
  'غ': 68,
  'ف': 69,
  'ق': 70,
  'ك': 71,
  'ل': 72,
  'م': 73,
  'ن': 74,
  'ه': 75,
  'و': 76,
  'ى': 77,
  'ي': 78,
};

const Map<int, String> RNN_REV_CLASSES_MAPPING = {
  0: '', // empty
  1: 'َ', // a
  2: 'ً', // an
  3: 'ُ', // u
  4: 'ٌ', // un
  5: 'ِ', // i
  6: 'ٍ', // in
  7: 'ْ', // sukun
  8: 'ّ', // shadda
  9: 'َّ', // shadda a
  10: 'ًّ', // shadda an
  11: 'ُّ', // shadda u
  12: 'ٌّ', // shadda un
  13: 'ِّ', // shadda i
  14: 'ٍّ', // shadda in
  15: '<PAD>',
  16: '<SOS>',
  17: '<EOS>',
  18: '<N/A>'
};
